- df.groupby
  - df.groupby(by='origin')['cylinders'].size()  
    : 특정 컬럼 값의 크기를 보고싶을 때
  - df.groupby(by='origin')['cylinders'].mean()  
    : 특정 컬럼의 평균을 보고싶을 때
        
        
- shift()   ***
  - df2.shift(1) : 아래 행 방향으로 하나씩 Shift(이동)함
  - df2.shift(-1) : 위 행 방향으로 하나씩 Shift(이동)함
  - df2['b'].shift(-1) : 특정 Column(열)을 이동할 경우
  
  
- rank(): 순위
  - df['model_year'].rank(method='min')  
    : 값이 적은 순서대로
  - df['model_year'].rank(pct=True)  # pct  
    : 비율이 어느 정도인지 알려줌
    
    
- cummax, cummin, cumprod
  - df2.cumpord() : 누적 곱(Cumulative Product)

In [1]:
import pandas as pd
import seaborn as sns

In [2]:
df = sns.load_dataset('mpg')
df.head(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite

In [3]:
df.groupby(by='origin').size()

origin
europe     70
japan      79
usa       249
dtype: int64

In [5]:
df['origin'].value_counts()

usa       249
japan      79
europe     70
Name: origin, dtype: int64

In [6]:
df.groupby(by='origin').min()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,name
origin,,,,,,,,
europe,16.2,4,68.0,46.0,1825,12.2,70,audi 100 ls
japan,18.0,3,70.0,52.0,1613,11.4,70,datsun 1200
usa,9.0,4,85.0,52.0,1800,8.0,70,amc ambassador brougham

In [7]:
df.groupby(by='origin').max()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,name
origin,,,,,,,,
europe,44.3,6,183.0,133.0,3820,24.8,82,vw rabbit custom
japan,46.6,6,168.0,132.0,2930,21.0,82,toyouta corona mark ii (sw)
usa,39.0,8,455.0,230.0,5140,22.2,82,pontiac ventura sj

In [8]:
df.groupby(by='origin').mean()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
origin,,,,,,,
europe,27.891429,4.157143,109.142857,80.558824,2423.300000,16.787143,75.814286
japan,30.450633,4.101266,102.708861,79.835443,2221.227848,16.172152,77.443038
usa,20.083534,6.248996,245.901606,119.048980,3361.931727,15.033735,75.610442

In [9]:
df.groupby(by='origin')['cylinders'].size()  # 특정컬럼값을 보고싶을 때

origin
europe     70
japan      79
usa       249
Name: cylinders, dtype: int64

In [10]:
df.groupby(by='origin')['cylinders'].mean()  # 특정컬럼값을 보고싶을 때

origin
europe    4.157143
japan     4.101266
usa       6.248996
Name: cylinders, dtype: float64

In [11]:
df.groupby(['model_year', 'origin'])['cylinders'].mean()   # 특정컬럼값을 보고싶을 때

model_year  origin
70          europe    4.000000
            japan     4.000000
            usa       7.636364
71          europe    4.000000
            japan     4.000000
            usa       6.200000
72          europe    4.000000
            japan     3.800000
            usa       6.888889
73          europe    4.000000
            japan     4.250000
            usa       7.241379
74          europe    4.000000
            japan     4.000000
            usa       6.266667
75          europe    4.000000
            japan     4.000000
            usa       6.400000
76          europe    4.250000
            japan     4.500000
            usa       6.363636
77          europe    4.000000
            japan     4.166667
            usa       6.222222
78          europe    4.833333
            japan     4.000000
            usa       6.000000
79          europe    4.250000
            japan     4.000000
            usa       6.260870
80          europe    4.111111
            japan     4.076923
            usa       4.285714
81          europe    4.500000
            japan     4.333333
            usa       4.923077
82          europe    4.000000
            japan     4.000000
            usa       4.300000
Name: cylinders, dtype: float64

In [12]:
pd.DataFrame(df.groupby(['model_year', 'origin'])['cylinders'].mean())   # 특정컬럼값을 보고싶을 때

                   cylinders
model_year origin
70         europe   4.000000
           japan    4.000000
           usa      7.636364
71         europe   4.000000
           japan    4.000000
           usa      6.200000
72         europe   4.000000
           japan    3.800000
           usa      6.888889
73         europe   4.000000
           japan    4.250000
           usa      7.241379
74         europe   4.000000
           japan    4.000000
           usa      6.266667
75         europe   4.000000
           japan    4.000000
           usa      6.400000
76         europe   4.250000
           japan    4.500000
           usa      6.363636
77         europe   4.000000
           japan    4.166667
           usa      6.222222
78         europe   4.833333
           japan    4.000000
           usa      6.000000
79         europe   4.250000
           japan    4.000000
           usa      6.260870
80         europe   4.111111
           japan    4.076923
           usa      4.285714
81         europe   4.500000
           japan    4.333333
           usa      4.923077
82         europe   4.000000
           japan    4.000000
           usa      4.300000

In [14]:
df2 = pd.DataFrame(
[[4, 7, 10],
[5, 11, 8],
[6, 9, 12]],
index=[1,2,3],
columns = ['a','b','c'])
df2

   a   b   c
1  4   7  10
2  5  11   8
3  6   9  12

In [15]:
df2.shift(1)  # 아래 행 방향으로 하나씩 shift(이동)함

     a     b     c
1  NaN   NaN   NaN
2  4.0   7.0  10.0
3  5.0  11.0   8.0

In [16]:
df2.shift(-1)  # 위 행 방향으로 하나씩 shift(이동)함

     a     b     c
1  5.0  11.0   8.0
2  6.0   9.0  12.0
3  NaN   NaN   NaN

In [17]:
df2['b'].shift(-1)   # 특정 column(열)을 이동할 경우

1    11.0
2     9.0
3     NaN
Name: b, dtype: float64

In [18]:
df2['b'].shift(2)

1    NaN
2    NaN
3    7.0
Name: b, dtype: float64

- rank: 순위

In [19]:
df['model_year'].rank(method='min')

0        1.0
1        1.0
2        1.0
3        1.0
4        1.0
       ...
393    368.0
394    368.0
395    368.0
396    368.0
397    368.0
Name: model_year, Length: 398, dtype: float64

In [20]:
df['model_year'].rank(method='min').value_counts()

86.0     40
245.0    36
183.0    34
368.0    31
153.0    30
1.0      29
281.0    29
310.0    29
339.0    29
30.0     28
58.0     28
217.0    28
126.0    27
Name: model_year, dtype: int64

In [21]:
df['model_year'].rank(method='max')

0       29.0
1       29.0
2       29.0
3       29.0
4       29.0
       ...
393    398.0
394    398.0
395    398.0
396    398.0
397    398.0
Name: model_year, Length: 398, dtype: float64

In [22]:
df['model_year'].rank(pct=True)  # pct: 비율이 어느정도인지 알려줌

0      0.037688
1      0.037688
2      0.037688
3      0.037688
4      0.037688
         ...
393    0.962312
394    0.962312
395    0.962312
396    0.962312
397    0.962312
Name: model_year, Length: 398, dtype: float64

In [23]:
df['model_year'].rank(method='first').head()

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
Name: model_year, dtype: float64

In [24]:
df2

   a   b   c
1  4   7  10
2  5  11   8
3  6   9  12

In [25]:
df2.cumsum()  # 누적합

    a   b   c
1   4   7  10
2   9  18  18
3  15  27  30

In [26]:
df2.cummax()

   a   b   c
1  4   7  10
2  5  11  10
3  6  11  12

In [27]:
df2.cummin()

   a  b   c
1  4  7  10
2  4  7   8
3  4  7   8

In [28]:
df2.cumprod()  # 누적곱(cummulate product)

     a    b    c
1    4    7   10
2   20   77   80
3  120  693  960